/*******************************************************************************
程序内存的4个区
==================================
  堆区(heap)操作系统管理
----------------------------------
  栈区(stack)程序局部变量
----------------------------------
  全局区(global)常量和全局变量
----------------------------------
  代码区(code)操作系统管理
==================================

C语言中的灰色地带: 全局变量可以重复定义

指针指向谁就把谁的地址赋给指针

*******************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int main1(int arcg, const char *argv[])
{
    int a = 10; //分配4个字节内存 栈区也叫临时区
    int *p;     //分配4字节内存

    p = &a;     //CPU执行代码，放在代码区
    *p = 20;

    p = (char *)malloc(100);  //内存泄漏概念

    free(p);

    return 0;
}

char *GetString()
{
    char *p = "abcd";  //"abcd"在全局区

    return p;          //p在栈区
}


